{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "tiiuae/falcon-7b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 96,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "dense_h_to_4h",
    "dense_4h_to_h",
    "query_key_value",
    "dense"
  ],
  "task_type": "CAUSAL_LM"
}